import csv

data = [
    ["292.8","10.8","10.6","36.7","Сырная","small","thick","309","310","Моцарелла, сыры чеддер и пармезан, фирменный соус альфредо","/images/pizza/cheese.jpg"],
    ["292.8","10.8","10.6","36.7","Сырная","average","thin","599","360","Моцарелла, сыры чеддер и пармезан, фирменный соус альфредо","/images/pizza/cheese.jpg"],
    ["292.8","10.8","10.6","36.7","Сырная","average","thick","599","470","Моцарелла, сыры чеддер и пармезан, фирменный соус альфредо","/images/pizza/cheese.jpg"],
    ["292.8","10.8","10.6","36.7","Сырная","large","thin","749","530","Моцарелла, сыры чеддер и пармезан, фирменный соус альфредо","/images/pizza/cheese.jpg"],
    ["292.8","10.8","10.6","36.7","Сырная","large","thick","749","640","Моцарелла, сыры чеддер и пармезан, фирменный соус альфредо","/images/pizza/cheese.jpg"],
    ["257.9","10.5","9.8","30.1","Пепперони фреш","small","thick","369","380","Пикантная пепперони, увеличенная порция моцареллы, томаты , фирменный томатный соус","/images/pizza/pepperoni_fresh.jpg"],
    ["257.9","10.5","9.8","30.1","Пепперони фреш","average","thin","629","490","Пикантная пепперони, увеличенная порция моцареллы, томаты , фирменный томатный соус","/images/pizza/pepperoni_fresh.jpg"],
    ["257.9","10.5","9.8","30.1","Пепперони фреш","average","thick","629","590","Пикантная пепперони, увеличенная порция моцареллы, томаты , фирменный томатный соус","/images/pizza/pepperoni_fresh.jpg"],
    ["257.9","10.5","9.8","30.1","Пепперони фреш","large","thin","749","670","Пикантная пепперони, увеличенная порция моцареллы, томаты , фирменный томатный соус","/images/pizza/pepperoni_fresh.jpg"],
    ["257.9","10.5","9.8","30.1","Пепперони фреш","large","thick","749","790","Пикантная пепперони, увеличенная порция моцареллы, томаты , фирменный томатный соус","/images/pizza/pepperoni_fresh.jpg"],
    ["265.1","11.5","8.8","33.2","Двойной цыпленок","small","thick","479","360","Цыпленок, моцарелла, фирменный соус альфредо","/images/pizza/double_chiken.jpg"],
    ["265.1","11.5","8.8","33.2","Двойной цыпленок","average","thin","709","430","Цыпленок, моцарелла, фирменный соус альфредо","/images/pizza/double_chiken.jpg"],
    ["265.1","11.5","8.8","33.2","Двойной цыпленок","average","thick","709","520","Цыпленок, моцарелла, фирменный соус альфредо","/images/pizza/double_chiken.jpg"],
    ["265.1","11.5","8.8","33.2","Двойной цыпленок","large","thin","829","610","Цыпленок, моцарелла, фирменный соус альфредо","/images/pizza/double_chiken.jpg"],
    ["265.1","11.5","8.8","33.2","Двойной цыпленок","large","thick","809","730","Цыпленок, моцарелла, фирменный соус альфредо","/images/pizza/double_chiken.jpg"],
    ["282.1","10.7","9.8","35.9","Ветчина и сыр","small","thick","459","320","Ветчина, моцарелла, фирменный соус альфредо","/images/pizza/ham_cheese.jpg"],
    ["282.1","10.7","9.8","35.9","Ветчина и сыр","average","thin","679","370","Ветчина, моцарелла, фирменный соус альфредо","/images/pizza/ham_cheese.jpg"],
    ["282.1","10.7","9.8","35.9","Ветчина и сыр","average","thick","679","480","Ветчина, моцарелла, фирменный соус альфредо","/images/pizza/ham_cheese.jpg"],
    ["282.1","10.7","9.8","35.9","Ветчина и сыр","large","thin","809","550","Ветчина, моцарелла, фирменный соус альфредо","/images/pizza/ham_cheese.jpg"],
    ["282.1","10.7","9.8","35.9","Ветчина и сыр","large","thick","809","630","Ветчина, моцарелла, фирменный соус альфредо","/images/pizza/ham_cheese.jpg"],
    ["267.3","10.0","8.3","36.4","Чопизо фреш","small","thick","309","330","Острые колбаски чоризо, сладкий перец , моцарелла, фирменный томатный соус","/images/pizza/chorizo_fresh.jpg"],
    ["267.3","10.0","8.3","36.4","Чопизо фреш","average","thin","599","380","Острые колбаски чоризо, сладкий перец , моцарелла, фирменный томатный соус","/images/pizza/chorizo_fresh.jpg"],
    ["267.3","10.0","8.3","36.4","Чопизо фреш","average","thick","599","470","Острые колбаски чоризо, сладкий перец , моцарелла, фирменный томатный соус","/images/pizza/chorizo_fresh.jpg"],
    ["267.3","10.0","8.3","36.4","Чопизо фреш","large","thin","759","500","Острые колбаски чоризо, сладкий перец , моцарелла, фирменный томатный соус","/images/pizza/chorizo_fresh.jpg"],
    ["267.3","10.0","8.3","36.4","Чопизо фреш","large","thick","759","630","Острые колбаски чоризо, сладкий перец , моцарелла, фирменный томатный соус","/images/pizza/chorizo_fresh.jpg"],
    ["237.0","10.1","8.5","28.5","Жюльен","small","thick","609","430","Цыпленок , шампиньоны , ароматный грибной соус, красный лук , чеснок , моцарелла, смесь сыров чеддер и пармезан , фирменный соус альфредо","/images/pizza/julienne.jpg"],
    ["237.0","10.1","8.5","28.5","Жюльен","average","thin","909","510","Цыпленок , шампиньоны , ароматный грибной соус, красный лук , чеснок , моцарелла, смесь сыров чеддер и пармезан , фирменный соус альфредо","/images/pizza/julienne.jpg"],
    ["237.0","10.1","8.5","28.5","Жюльен","average","thick","909","630","Цыпленок , шампиньоны , ароматный грибной соус, красный лук , чеснок , моцарелла, смесь сыров чеддер и пармезан , фирменный соус альфредо","/images/pizza/julienne.jpg"],
    ["237.0","10.1","8.5","28.5","Жюльен","large","thin","1049","730","Цыпленок , шампиньоны , ароматный грибной соус, красный лук , чеснок , моцарелла, смесь сыров чеддер и пармезан , фирменный соус альфредо","/images/pizza/julienne.jpg"],
    ["237.0","10.1","8.5","28.5","Жюльен","large","thick","1049","820","Цыпленок , шампиньоны , ароматный грибной соус, красный лук , чеснок , моцарелла, смесь сыров чеддер и пармезан , фирменный соус альфредо","/images/pizza/julienne.jpg"],
    ["293.0","10.9","13.4","30.1","Додо микс","small","thick","579","400","Бекон , цыпленок , ветчина , сыры чеддер и пармезан , соус песто, кубики брынзы , томаты , красный лук , моцарелла, фирменный соус альфредо, чеснок , итальянские травы ","/images/pizza/dodo_mix.jpg"],
    ["293.0","10.9","13.4","30.1","Додо микс","average","thin","879","490","Бекон , цыпленок , ветчина , сыры чеддер и пармезан , соус песто, кубики брынзы , томаты , красный лук , моцарелла, фирменный соус альфредо, чеснок , итальянские травы ","/images/pizza/dodo_mix.jpg"],
    ["293.0","10.9","13.4","30.1","Додо микс","average","thick","879","610","Бекон , цыпленок , ветчина , сыры чеддер и пармезан , соус песто, кубики брынзы , томаты , красный лук , моцарелла, фирменный соус альфредо, чеснок , итальянские травы ","/images/pizza/dodo_mix.jpg"],
    ["293.0","10.9","13.4","30.1","Додо микс","large","thin","1029","700","Бекон , цыпленок , ветчина , сыры чеддер и пармезан , соус песто, кубики брынзы , томаты , красный лук , моцарелла, фирменный соус альфредо, чеснок , итальянские травы ","/images/pizza/dodo_mix.jpg"],
    ["293.0","10.9","13.4","30.1","Додо микс","large","thick","1029","830","Бекон , цыпленок , ветчина , сыры чеддер и пармезан , соус песто, кубики брынзы , томаты , красный лук , моцарелла, фирменный соус альфредо, чеснок , итальянские травы ","/images/pizza/dodo_mix.jpg"],
    ["269.2","11.1","10.8","30.1","Песто","small","thick","639","400","Цыпленок , соус песто, кубики брынзы , томаты , моцарелла, фирменный соус альфредо","/images/pizza/pesto.jpg"],
    ["269.2","11.1","10.8","30.1","Песто","average","thin","899","490","Цыпленок , соус песто, кубики брынзы , томаты , моцарелла, фирменный соус альфредо","/images/pizza/pesto.jpg"],
    ["269.2","11.1","10.8","30.1","Песто","average","thick","899","610","Цыпленок , соус песто, кубики брынзы , томаты , моцарелла, фирменный соус альфредо","/images/pizza/pesto.jpg"],
    ["269.2","11.1","10.8","30.1","Песто","large","thin","1069","740","Цыпленок , соус песто, кубики брынзы , томаты , моцарелла, фирменный соус альфредо","/images/pizza/pesto.jpg"],
    ["269.2","11.1","10.8","30.1","Песто","large","thick","1069","810","Цыпленок , соус песто, кубики брынзы , томаты , моцарелла, фирменный соус альфредо","/images/pizza/pesto.jpg"],
    ["312.2","9.8","16.3","29.3","Карбонара","small","thick","649","410","Бекон , сыры чеддер и пармезан , моцарелла, томаты , красный лук , чеснок , фирменный соус альфредо, итальянские травы","/images/pizza/carbonara.jpg"],
    ["312.2","9.8","16.3","29.3","Карбонара","average","thin","989","520","Бекон , сыры чеддер и пармезан , моцарелла, томаты , красный лук , чеснок , фирменный соус альфредо, итальянские травы","/images/pizza/carbonara.jpg"],
    ["312.2","9.8","16.3","29.3","Карбонара","average","thick","989","590","Бекон , сыры чеддер и пармезан , моцарелла, томаты , красный лук , чеснок , фирменный соус альфредо, итальянские травы","/images/pizza/carbonara.jpg"],
    ["312.2","9.8","16.3","29.3","Карбонара","large","thin","1099","710","Бекон , сыры чеддер и пармезан , моцарелла, томаты , красный лук , чеснок , фирменный соус альфредо, итальянские травы","/images/pizza/carbonara.jpg"],
    ["312.2","9.8","16.3","29.3","Карбонара","large","thick","1099","800","Бекон , сыры чеддер и пармезан , моцарелла, томаты , красный лук , чеснок , фирменный соус альфредо, итальянские травы","/images/pizza/carbonara.jpg"],
    ["264.2","11.5","9.9","30.5","Мясная","small","thick","599","390","Цыпленок , ветчина , пикантная пепперони , острые колбаски чоризо , моцарелла, фирменный томатный соус","/images/pizza/meat.jpg"],
    ["264.2","11.5","9.9","30.5","Мясная","average","thin","889","490","Цыпленок , ветчина , пикантная пепперони , острые колбаски чоризо , моцарелла, фирменный томатный соус","/images/pizza/meat.jpg"],
    ["264.2","11.5","9.9","30.5","Мясная","average","thick","889","590","Цыпленок , ветчина , пикантная пепперони , острые колбаски чоризо , моцарелла, фирменный томатный соус","/images/pizza/meat.jpg"],
    ["264.2","11.5","9.9","30.5","Мясная","large","thin","1049","700","Цыпленок , ветчина , пикантная пепперони , острые колбаски чоризо , моцарелла, фирменный томатный соус","/images/pizza/meat.jpg"],
    ["264.2","11.5","9.9","30.5","Мясная","large","thick","1049","820","Цыпленок , ветчина , пикантная пепперони , острые колбаски чоризо , моцарелла, фирменный томатный соус","/images/pizza/meat.jpg"],
]

with open('pizzas.csv', mode='w', newline='', encoding='utf-8') as file:
    writer = csv.writer(file)

    writer.writerow(["Название пиццы", "Состав"])

    for row in data:
        writer.writerow(row)

print("Данные записаны в файл pizza.csv")
